
## LAB REPORT 1 Description of Assignment:

For this lab report, you will be working with the titanic ml dadataset. You would use this dataset to learn to wrangle dataframes.


## Data Description/Challenges:

The sinking of the Titanic is one of the most infamous shipwrecks in history.
On April $15$, $1912$, during her maiden voyage, the widely considered “unsinkable” RMS Titanic sank after colliding with an iceberg. Unfortunately, there weren’t enough lifeboats for everyone onboard, resulting in the death of $1502$ out of $2224$ passengers and crew.

In this challenge, you are tasked to do some wrangling on the data and find ways to understand the data a bit more. This aassignment is due Thursday, January 30, 2025

#### 1. import the necessary libraries

In [5]:
import numpy
import pandas as pd
import csv

#### 2.  Load the train data in a variable name called "train"

In [16]:
traincsv='/content/train.csv'
train=pd.read_csv(traincsv)
print(train)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

#### 3.  Load the test data in a variable name called "test"

In [15]:
testcsv='/content/test.csv'
test=pd.read_csv(testcsv)
print(test)

     PassengerId  Pclass                                          Name  \
0            892       3                              Kelly, Mr. James
1            893       3              Wilkes, Mrs. James (Ellen Needs)
2            894       2                     Myles, Mr. Thomas Francis
3            895       3                              Wirz, Mr. Albert
4            896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..           ...     ...                                           ...
413         1305       3                            Spector, Mr. Woolf
414         1306       1                  Oliva y Ocana, Dona. Fermina
415         1307       3                  Saether, Mr. Simon Sivertsen
416         1308       3                           Ware, Mr. Frederick
417         1309       3                      Peter, Master. Michael J

        Sex   Age  SibSp  Parch              Ticket      Fare Cabin Embarked
0      male  34.5      0      0              330911    7.8292   NaN        Q
1    female  47.0      1      0              363272    7.0000   NaN        S
2      male  62.0      0      0              240276    9.6875   NaN        Q
3      male  27.0      0      0              315154    8.6625   NaN        S
4    female  22.0      1      1             3101298   12.2875   NaN        S
..      ...   ...    ...    ...                 ...       ...   ...      ...
413    male   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  female  39.0      0      0            PC 17758  108.9000  C105        C
415    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416    male   NaN      0      0              359309    8.0500   NaN        S
417    male   NaN      1      1                2668   22.3583   NaN        C

[418 rows x 11 columns]

#### 4.  Check the shape of the train and test data

In [17]:
print("Train data shape:", train.shape)
print("Test data shape:", test.shape)

Train data shape: (891, 12)
Test data shape: (418, 11)

#### 5.  Comment on how many rows and columns the train and test data both have

In [19]:
print("Train data has", train.shape[0], "rows and", train.shape[1], "columns.")
print("Test data has", test.shape[0], "rows and", test.shape[1], "columns.")

Train data has 891 rows and 12 columns.
Test data has 418 rows and 11 columns.

#### 6.  Check the last 5 rows of the train and test data respectively.

In [20]:
print("Last 5 rows of train data:")
print(train.tail())
print("Last 5 rows of test data:")
print(test.tail())

Last 5 rows of train data:
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q
Last 5 rows of test data:
     PassengerId  Pclass                          Name     Sex   Age  SibSp  \
413         1305       3            Spector, Mr. Woolf    male   NaN      0
414         1306       1  Oliva y Ocana, Dona. Fermina  female  39.0      0
415         1307       3  Saether, Mr. Simon Sivertsen    male  38.5      0
416         1308       3           Ware, Mr. Frederick    male   NaN      0
417         1309       3      Peter, Master. Michael J    male   NaN      1

     Parch              Ticket      Fare Cabin Embarked
413      0           A.5. 3236    8.0500   NaN        S
414      0            PC 17758  108.9000  C105        C
415      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416      0              359309    8.0500   NaN        S
417      1                2668   22.3583   NaN        C

#### 7.  Do a describitive of both the train and test data. Comment on the results from both data.

In [21]:
print("Describing train data:")
print(train.describe())
print('Statistical description: ')
print("Describing test data:")
print(test.describe())
print('Statistical description: ')

Describing train data:
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
Describing test data:
       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

#### 8.  What are the column names in the train and test data respectively. Do you have any column in train which is absent in the test

In [26]:
print("Column names in train data:")
print(train.columns)
print("Column names in test data:")
print(test.columns)

print("\nThe absent column is 'Survived'")

Column names in train data:
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Column names in test data:
Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

The absent column is 'Survived'

#### 9.  Counts for the passengers who survived. Do this for only the train data

In [28]:
print("Counts for passengers who survived in the train data:")
print('0: male  |  1: Female')
print(train['Survived'].value_counts())

Counts for passengers who survived in the train data:
0: male  |  1: Female
Survived
0    549
1    342
Name: count, dtype: int64

#### 10.  Extract only the titles from the name columns in the train
**Hint**: Check on using regular expression to extract the title from the name column.

In [35]:
#way one
#print("Extracting titles from the name column in the train data:")
#print(train['Name'])
#train['Title'] = train['Name'].str.extract(' ([A-Za-z]+)\.', expand=True)
#print(train['Title'])


#way two
#titles = ['Mr', 'Mrs', 'Miss', 'Master', 'Dr', 'Rev']
#train['Title'] = train['Name'].apply(lambda x: next((title for title in titles if title in x), 'Other'))
#print(train['Title'])


#way there
for title in ['Mr', 'Mrs', 'Miss', 'Master', 'Dr', 'Rev']:
    train.loc[train['Name'].str.contains(title), 'Title'] = title
train['Title'].fillna('Other', inplace=True)
print(train['Title'])

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: Title, Length: 891, dtype: object

<ipython-input-35-c460934c3253>:17: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  train['Title'].fillna('Other', inplace=True)

**Note:** You can only do this question after doing the previous question
 #### 11. Create a new column and call it "Title" to save the extracted titles above

In [36]:

print(train['Title'])

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: Title, Length: 891, dtype: object

#### 12.  Use this dictionary to change the title names in the train.Title created column

mapping = {'Mlle': 'Miss', 'Major': 'Mr', 'Col': 'Mr', 'Sir': 'Mr',
           'Don': 'Mr', 'Mme': 'Mrs', 'Jonkheer': 'Mr', 'Lady': 'Mrs',
           'Capt': 'Mr', 'Countess': 'Mrs', 'Ms': 'Miss', 'Dona': 'Mrs'}

In [51]:
#fix this
mapping = {'Mlle': 'Miss', 'Major': 'Mr', 'Col': 'Mr', 'Sir': 'Mr',
           'Don': 'Mr', 'Mme': 'Mrs', 'Jonkheer': 'Mr', 'Lady': 'Mrs',
           'Capt': 'Mr', 'Countess': 'Mrs', 'Ms': 'Miss', 'Dona': 'Mrs'}

train['Title'] = train['Title'].replace(mapping)
print(train)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Title
0        0         A/5 21171   7.2500   NaN        S  Other
1        0          PC 17599  71.2833   C85        C  Other
2        0  STON/O2. 3101282   7.9250   NaN        S  Other
3        0            113803  53.1000  C123        S  Other
4        0            373450   8.0500   NaN        S  Other
..     ...               ...      ...   ...      ...    ...
886      0            211536  13.0000   NaN        S  Other
887      0            112053  30.0000   B42        S  Other
888      2        W./C. 6607  23.4500   NaN        S  Other
889      0            111369  30.0000  C148        C  Other
890      0            370376   7.7500   NaN        Q  Other

[891 rows x 13 columns]

#### 13.  Value counts after changing some titles

In [52]:
train['Title'].value_counts()

Title
Other    891
Name: count, dtype: int64

#### 14. Group data by class and view the averages for each column

In [53]:
#fix this
class_grouped = train.groupby('Pclass').mean()
print("Averages by class:\n", class_grouped)

TypeError: agg function failed [how->mean,dtype->object]

#### 15.  What do you observe from the  above groupby table? Discuss and write down your thoughts

#### 16.  Group by Pclass and sex and find the mean

#### 17. **Missing Values**

#### 18.  How many missing values are in train data  and test respectively.

In [54]:
train.isnull().sum()
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

#### 19.  Which of columns in the train data had missing values?

In [57]:
train.columns[train.isnull().any()]

train.columns[train.isnull().any()].tolist()

['Age', 'Cabin', 'Embarked']

#### 20.  Which of columns in the test data had missing values?

In [59]:
test.columns[test.isnull().any()].tolist()

['Age', 'Fare', 'Cabin']

#### 21.  First drop all missing values and check the counts for missing value again

In [61]:
train.dropna()
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
Title          0
dtype: int64

**Remember** Do not run the code on dropping all missing values the second time

#### 22.  Reload the data and drop the missing values in age with the mean

In [66]:
train['Age'].fillna(train['Age'].mean())
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
Title          0
dtype: int64

#### 23. Drop the missing values with the Embarked with the mode

In [ ]:
train['Embarked'].fillna(train['Embarked.mode()[0]'])
train.isnull().sum()

#### 24. Merge the two dataframes and called it df.Check to the number of rows and columns and number of missing values

In [64]:
df=pd.concat([train,test])
df.shape
df.isnull().sum()

PassengerId      0
Survived       418
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
Title          418
dtype: int64